app/Controllers/Home.php

    public function loginAjax()
    {
        // Certifique-se de que a requisição é POST e AJAX
        if (!$this->request->isAJAX() || $this->request->getMethod() != 'post') {
            return $this->response->setStatusCode(403)->setJSON(['success' => false, 'message' => 'Acesso não autorizado.']);
        }

        $model = new UserModel();
        $usernameOrEmail = $this->request->getPost('username_or_email');
        $password = $this->request->getPost('password');

        // 1. Verificar a existência e autenticação dos dados
        $user = $model->where('username', $usernameOrEmail)
                      ->orWhere('email', $usernameOrEmail)
                      ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'muhamad_yuraz'
OR `email` = 'muhamad_yuraz'
 LIMIT 1

                // Password incorreta
                // Incrementar tentativas e registrar o timestamp
                $newAttempts = $currentAttempts + 1;
                $model->update($user['id'], [
                    'login_attempts' => $newAttempts,
                    'last_attempt_at' => $now->format('Y-m-d H:i:s')
                ]);
---
UPDATE `users` SET `login_attempts` = 3, `last_attempt_at` = '2025-07-17 18:12:16'
WHERE `users`.`id` IN ('1')